BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
#include <Arduino.h>

#include <LiquidCrystal_I2C.h>
LiquidCrystal_I2C LCD(0x3F,16,2); 

#include <SPIFFS.h>

#include <WiFi.h>
const char *ssid2 = "HUAWEI-B715-A231";
const char *password2 = "G6TT4Y3H5DA";
IPAddress ip;

#include "Network.h"
#include "Sys_Variables.h"
#include "CSS.h"

#include <ESP32WebServer.h>
ESP32WebServer server(80);
#include <ESPmDNS.h>

#include <sqlite3.h>
sqlite3 *db_base;

#include <OneButton.h>
//OneButton button4(26, true); OneButton button5(27, true); OneButton button6(14, true); OneButton button7(5, true);
//OneButton button1(26, true); OneButton button2(27, true); OneButton button3(14, true); 
OneButton button7(5, true);
OneButton button8(23, true);

#include <ESP32Encoder.h>
ESP32Encoder left_encoder;
ESP32Encoder right_encoder;
static int last_value_left_encoder, last_value_right_encoder;

struct Serial2MIDISettings
{
  static const long BaudRate = 31250;
  static const int8_t RxPin  = 16;
  static const int8_t TxPin  = 17;
};

#include <midi.h>
//MIDI_CREATE_INSTANCE(HardwareSerial, Serial2, MIDI);
MIDI_CREATE_CUSTOM_INSTANCE(HardwareSerial, Serial2, MIDI, Serial2MIDISettings);
#define MIDI_CHANNEL_OMNI 0

#include <Wire.h>
//#include <Adafruit_MCP23X17.h>
//Adafruit_MCP23X17 mcp;
/* Couleurs (format RGB)
const byte COLOR_BLACK = 0b000;
const byte COLOR_RED = 0b100;
const byte COLOR_GREEN = 0b010;
const byte COLOR_BLUE = 0b001;
const byte COLOR_MAGENTA = 0b101;
const byte COLOR_CYAN = 0b011;
const byte COLOR_YELLOW = 0b110;
const byte COLOR_WHITE = 0b111;*/
//const byte rgbcolor [8] = {0b000, 0b100, 0b010, 0b001, 0b101, 0b011, 0b110, 0b111};

static int i, j, k, l, m, tmp, choiced_foot_on_pacer, tmp2 = 0;
static int data_base_choice, old_bank, menus, stomp = 0; 
static int id, id_init, idcopy, global_count, startscreen, bank, ampero_count, tonex_count = 1;
static int initial_state, boutton_choice, encoder1_copy_source, encoder2_copy_destination = 1;
static short canal_midi_2 = 7; static short canal_midi_1 = 8;
static int preid = -1;
static int ampero_bank_choice, tonex_bank_choice = 0;

unsigned long previousMillis = 0;
unsigned long interval = 3000;

static short global_control_change [54] =  {
  //  |------CC------>>> AMPERO II STOMPS <<<-------CC-----------------| |------------CC------------>>> TONE X <<<--------------------------CC---------------------------------------------------------------------------------------------|
   0, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 13, 16, 18, 20, 7, 102, 23, 25, 28, 79, 19, 15, 106, 107, 103, 14, 16, 17, 18, 20, 21, 22, 24, 26, 27, 29, 30, 104, 75, 85, 76, 77, 78, 108, 109, 110, 111, 112, 113, 114, 115};
//{0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24,  25,  26,  27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39,  40, 41, 42, 43, 45, 45,  46,  47,  48,  49,  50,  51,  52,  53}
  //  Numéro colonne de la base de donnée


                                   //  |--------CC----------|      |--Positions dans BD--|
static short ampero_quick_values [2] [7] = {{-10, 7, 16, 18, 20, 13, 59}, {0, 17, 14, 15, 16, 13, 12}};
static short tonex_quick_values [2] [7] = {{-10, 103, 102, 19, 15, 106, 107}, {0, 27, 18, 23, 24, 25, 26}};

static const char* ampero_quick_names [7]  {"", "VOLUME     : ", "PARAM 1     : ", "PARAM 2    : ", "PARAM 3    : ", "PEDAL EXP  : ", "REVERB ON  : "};
static const char*  tonex_quick_names [7] {"", "MODEL.VOL  : ", "GAIN       : ", "COMPRESSOR : ", "GATE       : ", "PRESENCE   : ", "DEPHT      : "};
static int values_max_ampero_quick [7] = {0,100, 127, 127, 127, 1300, 1300};
static int values_mini_ampero_quick [7] = {0,0, 0, 0, 0, 1299, 1299};
static int values_max_tonex_quick [7] = {0,127, 127, 127, 127, 127, 127};
static int values_mini_tonex_quick [7] = {0,0, 0, 0, 0, 0, 0};

static int all_parameters [43][ 60];
static int all_data_base_parameters_copy [43] [60];
static int temp_transfert_datas [60];

static const char* line1_lcd_text;
static const char* line2_lcd_text;
static String slq_request;

static const char* global_names [57] = {  "", 
  "SLOT A1    : ", "SLOT A2    : ", "SLOT A3    : ", "SLOT A4    : ", "SLOT A5    : ", "SLOT A6    : ",
  "SLOT B1    : ", "SLOT B2    : ", "SLOT B3    : ", "SLOT B4    : ", "SLOT B5    : ", "SLOT B6    : ",
  "PEDAL EXP  : ", "PARAM 1    : ", "PARAM 2    : ", "PARAM 3    : ", "VOLUME     : ",
  "GAIN       : ", "BASS       : ", "MID        : ", "TREBLE     : ", "REVERB     : ", "COMPRESSOR : ",
  "NOISE GATE : ", "PRESENCE   : ", "DEPTH      : ", "MODEL.VOL  : ", "NOISE GT   : ", "NG REL     : ",
  "NG DPTH    : ", "COMP       : ", "CMP GAIN   : ", "COMP ATK   : ", "COMP PATC  : ",
  "BASS FRQ   : ", "MID Q      : ", "MID FRQ    : ", "TRBL FRQ   : ", "EQ PATCH   : ", "EQ MIX     : ",
  "REVERB     : ", "REV TYPE   : ", "REV TIME   : ", "VB PREDELAY: ", "REV COLOR  : ", "REV RESO   : ",
  "MIC 1      : ", "MIC 1 X    : ", "MIC 1 Z    : ", "MIC 2      : ", "MIC 2 X    : ", "MIC 2 Z    : ", "MICS MIX   : ",
  "NB FX MAX  : ", "PC Tone X  : ", "PC Ampero  : "
};

static int global_control_change_max_values [57] = {0,
  1300,1300,1300,1300,1300,1300,
  1300,1300,1300,1300,1300,1300,
  1300,127,127,127,100,
  127,127,127,127,127,127,
  127,127,127,127,1400,127,
  127,1300,127,127,1400,
  127,127,127,127,1400,127,
  1300,9,127,127,127,127,
  127,127,127,127,127,127,127,
  61,149,300
};

static int id_values_for_6_foot [37] = {0,1,8,15,22,29,36,43,50,57,64,71,78,85,92,99,106,113,120,127,134,141,148,155,162,169,176,183,190,197,204,211,218,225,232,239,246};

static const char* tonex_reverb_names [5] = {"SPRING1", "SPRING2", "SPRING3", "ROOM ", "PLATE"};

void program_change(byte CC, int val, byte canal) {
  MIDI.sendControlChange(0, CC, canal);
  MIDI.sendProgramChange(val, canal);
}

void midiblabla(byte a, byte b, byte c) {
      MIDI.sendControlChange(a, b, c);
      /*(""); Serial.print("ToneX -> CC : "); Serial.print(a); Serial.print(" - Val : ");
      Serial.print(b); Serial.print(" - Channel : "); Serial.println(c); */
}

void typereverb() {
  if (all_parameters[id][42] >= 0 && all_parameters[id][42] < 2) {midiblabla(global_control_change[42], 10, canal_midi_1);}
  if (all_parameters[id][42] >= 2 && all_parameters[id][42] < 4) {midiblabla(global_control_change[42], 20, canal_midi_1);}
  if (all_parameters[id][42] >= 4 && all_parameters[id][42] < 6) {midiblabla(global_control_change[42], 55, canal_midi_1);}
  if (all_parameters[id][42] >= 6 && all_parameters[id][42] < 8) {midiblabla(global_control_change[42], 85, canal_midi_1);}
  if (all_parameters[id][42] >= 8 && all_parameters[id][42] < 10) {midiblabla(global_control_change[42], 115, canal_midi_1);}
  //Serial.println(42);
}

static float valminimax [2] [57] = {
  {0,
    0,0,0,0,0,0,
    0,0,0,0,0,0,
    0,0,0,0,100,
    0,0,0,0,0,0,
    -100,0,0,0,1400,20,
    -20,1300,-30,1,1400,
    75,0.2,150,1000,1400,0,
    1300,1,0,0,0,0,
    0,0,0,0,0,0,0,
    61,150,300
  },
  {0,
    0,0,0,0,0,0,
    0,0,0,0,0,0,
    0,0,0,0,100,
    10,10,10,10,100,-40,
    0,10,10,10,1400,500,
    -100,1300,10,51,1400,
    600,3,5000,4000,1400,100,
    0,5,127,127,127,127,
    127,127,127,127,127,127,127,
    61,150,300
  }
};

float view_tonex_value, all_data_base_parameters;

void Scale_value_switch (byte val3) {
  view_tonex_value = (valminimax[1][global_count]-valminimax[0][global_count])*all_parameters[id][global_count]/global_control_change_max_values[global_count]+valminimax[0][global_count];
  switch (val3){
  case 1 :
    LCD.setCursor(12,1); LCD.print("    "); 
    if (view_tonex_value >=0 && view_tonex_value < 10) {LCD.setCursor(13,1);}
    if (view_tonex_value > 9.99 && view_tonex_value <= 100) {LCD.setCursor(12,1);}
    if (view_tonex_value < 0 && view_tonex_value < -100) {LCD.setCursor(13,1);}
    if (view_tonex_value < 0 && view_tonex_value >= -100) {LCD.setCursor(12,1);}
    LCD.print((valminimax[1][global_count]-valminimax[0][global_count])*all_parameters[id][global_count]/global_control_change_max_values[global_count]+valminimax[0][global_count]);
  break;
  case 2 :
    LCD.setCursor(12,1); LCD.print("    "); 
    if (view_tonex_value >=0 && view_tonex_value < 10) {LCD.setCursor(14,1);}
    if (view_tonex_value >=0 && view_tonex_value > 9 && view_tonex_value < 100) {LCD.setCursor(13,1);}
    if (view_tonex_value >=0 && view_tonex_value >= 100) {LCD.setCursor(12,1);}
    LCD.print(round((valminimax[1][global_count]-valminimax[0][global_count])*all_parameters[id][global_count]/global_control_change_max_values[global_count]+valminimax[0][global_count]));
    LCD.setCursor(15,1); LCD.print("%"); 
  break;
  case 3 :
    LCD.setCursor(9,1); LCD.print("       "); LCD.setCursor(9,1); 
    if (all_parameters[id][global_count] >= 0 && all_parameters[id][global_count] < 2) {LCD.print(tonex_reverb_names[0]);}
    if (all_parameters[id][global_count] >= 2 && all_parameters[id][global_count] < 4) {LCD.print(tonex_reverb_names[1]);}
    if (all_parameters[id][global_count] >= 4 && all_parameters[id][global_count] < 6) {LCD.print(tonex_reverb_names[2]);}
    if (all_parameters[id][global_count] >= 6 && all_parameters[id][global_count] < 8) {LCD.print(tonex_reverb_names[3]);}
    if (all_parameters[id][global_count] >= 8 && all_parameters[id][global_count] < 10) {LCD.print(tonex_reverb_names[4]);}
  break;
  }
}

void Screens (byte screen_choice, int val2) {
  //LCD.clear();
  String text;
  switch (screen_choice) {
    case 0 :
      LCD.clear();
      LCD.setCursor(1,0);
      LCD.print("AMPERO 2 STOMP");
      LCD.setCursor(5,1);
      LCD.print("TONE X");
    break;
    case 1 :
      if (global_count > 0 && global_count < 18){
        LCD.setCursor(0,0);
        if (line1_lcd_text != "P  B  *AMPERO II") 
           {line1_lcd_text  = "P  B  *AMPERO II"; 
          LCD.print(line1_lcd_text);
          LCD.setCursor(4,0); LCD.print(bank);
        }
        text = String(choiced_foot_on_pacer) + " ";LCD.setCursor(1,0); LCD.print(text);
      }
      if (global_count > 17 && global_count < 54){
        LCD.setCursor(0,0);        
        if (line1_lcd_text != "P  B     *TONE_X") {
           line1_lcd_text  = ("P  B     *TONE_X"); 
          LCD.print(line1_lcd_text);
          LCD.setCursor(4,0); LCD.print(bank);
        }
        text = String(choiced_foot_on_pacer) + " ";LCD.setCursor(1,0); LCD.print(text);
      }
      if (global_count == 54){
        if (line1_lcd_text != "*Fin Sauvegd") {
          LCD.setCursor(5,0); line1_lcd_text = "*Fin Sauvegd";
          LCD.print(line1_lcd_text);
        }
      }
      if (global_count == 55 or global_count == 56){
        if (line1_lcd_text != "*Prog Change") {
          LCD.setCursor(5,0); line1_lcd_text = "*Prog Change";
          LCD.print(line1_lcd_text);
        }
      }
      LCD.setCursor(0,1);
      if (line2_lcd_text != global_names[global_count]) {
        line2_lcd_text = global_names[global_count];
        LCD.print(line2_lcd_text);
      }
      LCD.setCursor(13,1);
      LCD.print("   ");
      LCD.setCursor(13,1); 
      if (global_count != 55 && global_count != 56) {
        if (val2 == 1399 or val2 == 1400) {
          if (val2 == 1399) {
            LCD.setCursor(10,1);
            LCD.print(":  PRE");
            val2 = 1399;
          }
          else {
            LCD.setCursor(10,1);
            LCD.print(": POST");
            val2 = 1400;
          }
        }
        if (val2 == 1300 or val2 == 1299) {
            if (all_parameters[id][global_count] == 1300) {
              LCD.print("ON "); val2 = 1300;
            }
            else {
              LCD.print("OFF"); val2 = 1299;
            }
        }
        if (all_parameters[id][global_count] < 128) {          
          if (global_count < 18) {
            LCD.print(all_parameters[id][global_count]);
          }
          if (global_count > 17) {
            if (valminimax[1][global_count] == 10) {
              Scale_value_switch(1);
            }
            if (global_count == 22 or global_count == 40 or global_count == 53) {
              Scale_value_switch(2);
            }
            if (global_count != 22 or global_count != 40 or global_count != 53 or valminimax[1][global_count] != 10 or global_count != 42) {
              LCD.print(all_parameters[id][global_count]);
            }
            if (global_count == 42) {
              Scale_value_switch(3);
            }
          }
          val2 = -1;
        } 
      }
      if(global_count == 55) {
        LCD.print(all_parameters[id][55]); 
        val2 = -1;
      }
      if(global_count == 56) {
        LCD.print(all_parameters[id][56]); 
        val2 = -1;
      } 
    break;
    case 2 :
        LCD.setCursor(0,0);
        if (line1_lcd_text != "P  B   AMPERO II") {
          line1_lcd_text  = "P  B   AMPERO II"; 
          LCD.print(line1_lcd_text);
          LCD.setCursor(4,0); LCD.print(bank);
        }
        text = String(choiced_foot_on_pacer) + " ";
        LCD.setCursor(1,0); 
        LCD.print(text);
        LCD.setCursor(0,1);
        if (line2_lcd_text != ampero_quick_names[ampero_count]) {
          line2_lcd_text = ampero_quick_names[ampero_count]; 
          LCD.print(line2_lcd_text);
        }
        LCD.setCursor(13,1); 
        LCD.print("   ");
        LCD.setCursor(13,1);
        if (val2 == 1399 or val2 == 1400) {
            if (val2 == 1399) {LCD.setCursor(10,1); 
              LCD.print(":  PRE"); 
              val2 = 1399;
            }
          else {
            LCD.setCursor(10,1); 
            LCD.print(": POST"); 
            val2 = 1400;
          }
        }
        if (val2 == 1300 or val2 == 1299) {
          if (val2 == 1300) {
            LCD.print("ON "); 
            val2 = 1300;
          }
          else {
            LCD.print("OFF"); 
            val2 = 1299;
          }
        }
        if (all_parameters[id][ampero_quick_values[1][ampero_count]] < 128) {
          LCD.print(all_parameters[id][ampero_quick_values[1][ampero_count]]); 
          val2 = -1;
        }
    break;
    case 3 :
        LCD.setCursor(0,0);
        if (line1_lcd_text != "P  B      TONE_X") {
          line1_lcd_text  = "P  B      TONE_X";
          LCD.print(line1_lcd_text);
          LCD.setCursor(4,0); LCD.print(bank);
        }
        text = String(choiced_foot_on_pacer) + " ";
        LCD.setCursor(1,0); 
        LCD.print(text);
        LCD.setCursor(0,1);
        if (line2_lcd_text != tonex_quick_names[tonex_count]) {
          line2_lcd_text = tonex_quick_names[tonex_count]; 
          LCD.print(line2_lcd_text);
        }
        LCD.setCursor(13,1); 
        LCD.print("   ");
        LCD.setCursor(13,1);
        if (val2 == 1399 or val2 == 1400) {
          if (val2 == 1399) {
            LCD.setCursor(10,1); 
            LCD.print(":  PRE"); 
            val2 = 1399;
          }
          else {
            LCD.setCursor(10,1); 
            LCD.print(": POST"); 
            val2 = 1400;
          }
        }
        if (val2 == 1299 or val2 == 1300) {
          if (val2 == 1300) {
            LCD.print("ON ");
            val2 = 1300;
          }
          else {
            LCD.print("OFF");
            val2 = 1299;
          }
        }
        if (all_parameters[id][tonex_quick_values[1][tonex_count]] < 128) {
          global_count = tonex_quick_values[1][tonex_count];
          //LCD.print(all_parameters[id][global_count]);
          if (valminimax[1][global_count] == 10) {
            Scale_value_switch(1);
          }
          if (global_count == 22 or global_count == 40 or global_count == 53) {
            Scale_value_switch(2);
          }
          if (global_count != 22 or global_count != 40 or global_count != 53 or valminimax[1][global_count] != 10 or global_count != 42) {
            LCD.print(all_parameters[id][global_count]);
          }
          if (global_count == 42) {
            Scale_value_switch(3);
          }
          val2 = -1;
        }
    break;
    case 4 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("choiced_foot_on_pacer :  |Bank:  ");
      LCD.setCursor(7,0);
      LCD.print(choiced_foot_on_pacer);
      LCD.setCursor(15,0);
      LCD.print(bank);
      LCD.setCursor(0,1);
      LCD.print("Stomp:  | Amp/Tx");
      LCD.setCursor(7,1);
      LCD.print(stomp);
    break;
    case 5 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("***  RESTART ***");
      LCD.setCursor(0,1);
      LCD.print("***** WAIT *****");
    break;
    case 6 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print(" Copy PATCH : ");
      LCD.setCursor(0,1);
      LCD.print("...To PATCH : ");
    break;
    case 7 :
      LCD.setCursor(14,0);
      LCD.print(encoder1_copy_source);
      if (encoder1_copy_source < 10) {LCD.setCursor(15,0); LCD.print(" ");}
    break;
    case 8 :
      byte tmp3, tmp4;
      LCD.setCursor(13,1);
      if (encoder2_copy_destination < 7) {tmp3 = 1;} 
      if (encoder2_copy_destination > 6 && encoder2_copy_destination < 13) {tmp3 = 2;} 
      if (encoder2_copy_destination > 12 && encoder2_copy_destination < 19) {tmp3 = 3;} 
      if (encoder2_copy_destination > 18 && encoder2_copy_destination < 25) {tmp3 = 4;}
      if (encoder2_copy_destination > 24 && encoder2_copy_destination < 31) {tmp3 = 5;} 
      if (encoder2_copy_destination > 30 && encoder2_copy_destination < 37) {tmp3 = 6;}
      if (encoder2_copy_destination == 1 or encoder2_copy_destination == 7  or encoder2_copy_destination == 13 or encoder2_copy_destination == 19 or encoder2_copy_destination == 25 or encoder2_copy_destination == 31) {tmp4 = 1;}
      if (encoder2_copy_destination == 2 or encoder2_copy_destination == 8  or encoder2_copy_destination == 14 or encoder2_copy_destination == 20 or encoder2_copy_destination == 26 or encoder2_copy_destination == 32) {tmp4 = 2;}
      if (encoder2_copy_destination == 3 or encoder2_copy_destination == 9  or encoder2_copy_destination == 15 or encoder2_copy_destination == 21 or encoder2_copy_destination == 27 or encoder2_copy_destination == 33) {tmp4 = 3;}
      if (encoder2_copy_destination == 4 or encoder2_copy_destination == 10 or encoder2_copy_destination == 16 or encoder2_copy_destination == 22 or encoder2_copy_destination == 28 or encoder2_copy_destination == 34) {tmp4 = 4;}
      if (encoder2_copy_destination == 5 or encoder2_copy_destination == 11 or encoder2_copy_destination == 17 or encoder2_copy_destination == 23 or encoder2_copy_destination == 29 or encoder2_copy_destination == 35) {tmp4 = 5;}
      if (encoder2_copy_destination == 6 or encoder2_copy_destination == 12 or encoder2_copy_destination == 18 or encoder2_copy_destination == 24 or encoder2_copy_destination == 30 or encoder2_copy_destination == 36) {tmp4 = 6;}
      text = String(tmp3) + "-" + String(tmp4);
      LCD.print(text);
    break;
    case 9 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("** CHARGEMENT **");
      LCD.setCursor(0,1);
      LCD.print("***  BANK    ***");
      LCD.setCursor(10,1);
      LCD.print(bank);
    break;
    case 10 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("** SAUVEGARDE **");
      LCD.setCursor(0,1);
      LCD.print("*** EN COURS ***");
    break;
    case 11 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("****  COPY  ****");
      LCD.setCursor(0,1);
      LCD.print("*** EN COURS ***");
    break;
    case 12 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("Copy Patch :    ");
      LCD.setCursor(0,1);
      LCD.print("<-DATA ** COPY->");
    break;
    case 13 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("* Copy en cours *");
      LCD.setCursor(0,1);
      LCD.print("** AMP/TONE-X **");
    break;
    case 14 :
      LCD.clear();
      LCD.setCursor(13,0);
      LCD.print(encoder1_copy_source);
    break;
  }
}

// ----------------------------------------------GESTTION BASE DE DONNEE
static const char* daTa = "Callback function called";
char *zErrMsg = 0;

static int db_open(const char *filename, sqlite3 **db) {
  sqlite3_open(filename, db);
  return 0;
}

