BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
static int call(void *daTa, int argc, char **argv, char **azColName) {
  static int m; String test = "Val = ";
    for (m = 0; m<argc; m++){
      String val = argv[m];
      String val2 = azColName[m];
      switch (data_base_choice){
        case 0 :
          all_parameters[i][m] = val.toInt(); all_data_base_parameters_copy [i][m] = val.toInt();
          //test += String(all_parameters[i][m]) + ", ";
        break;
        case 1 :
        break;
      } 
    }
  //Serial.println(test);
  id = 1;
  return 0;
}

static int db_exec(sqlite3 *db, const char *slq_request) {
  sqlite3_exec(db, slq_request, call, (void*)daTa, &zErrMsg);
  return 0;
}

void saveData() {
  if (db_open("/spiffs/base.db", &db_base)) return;
  slq_request = "UPDATE stomps SET ";
  for (i = 1; i < 57; i++){
    if (i < 56){
      //if (all_parameters[idcopy][i] != all_data_base_parameters_copy[idcopy][i]) {
        slq_request += "'"+String(i)+"'="+String(all_parameters[idcopy][i])+", "; 
      //}
    }
    if (i == 56){
        slq_request += "'"+String(i)+"'="+String(all_parameters[idcopy][i]); 
    }
  }
  if (bank == 1 ) {slq_request += " WHERE stomps_id="+String(idcopy)+";";}
  if (bank == 2 ) {slq_request += " WHERE stomps_id="+String(idcopy+42)+";";}
  if (bank == 3 ) {slq_request += " WHERE stomps_id="+String(idcopy+42*2)+";";}
  if (bank == 4 ) {slq_request += " WHERE stomps_id="+String(idcopy+42*3)+";";}
  if (bank == 5 ) {slq_request += " WHERE stomps_id="+String(idcopy+42*4)+";";}
  if (bank == 6 ) {slq_request += " WHERE stomps_id="+String(idcopy+42*5)+";";}
  db_exec(db_base, slq_request.c_str());
  sqlite3_close(db_base);
  Serial.println(slq_request);
}

void Save_copied_patch() {
  if (db_open("/spiffs/base.db", &db_base)) return;
  slq_request = "UPDATE stomps SET ";
  for (i = 1; i < 60; i++){
    if (i < 58){
      slq_request += "'"+String(i)+"'="+String(temp_transfert_datas[i])+", ";
    }
    if (i == 58){
      slq_request += "'"+String(i)+"'="+String(temp_transfert_datas[i]); 
    }
  }
  slq_request += " WHERE stomps_id="+String(idcopy)+";";
  db_exec(db_base, slq_request.c_str());
  sqlite3_close(db_base);
  Serial.println(slq_request);
}

void Save_scenes() {
  if (l == 1) { //Data Read Only
    slq_request = "UPDATE stomps SET ";
    for (i = 1; i < 59; i++){
      if (i < 58){
      slq_request += "'"+String(i)+"'="+String(all_parameters[j][i])+", "; 
      } 
      if (i == 58){
      slq_request += "'"+String(i)+"'="+String(all_parameters[j][i]);
      }
    }
    slq_request += " WHERE stomps_id="+String(idcopy)+";";
    Serial.println(slq_request);
  }
  if (l == 2) { // Copy Data Main -> 6 prochains
    if (db_open("/spiffs/base.db", &db_base)) return;
    slq_request = "UPDATE stomps SET ";
    for (i = 1; i < 59; i++){
      if (i < 58){
      slq_request += "'"+String(i)+"'="+String(all_parameters[j][i])+", ";all_data_base_parameters_copy[j][i] = all_parameters[j][i];
      } 
      if (i == 58){
      slq_request += "'"+String(i)+"'="+String(all_parameters[j][i]); all_data_base_parameters_copy[j][i] = all_parameters[j][i];
      }
    }
    slq_request += " WHERE stomps_id="+String(idcopy)+";";
    db_exec(db_base, slq_request.c_str());
    sqlite3_close(db_base);
    Serial.println(slq_request);
  }
}

void readData (){
  data_base_choice = 0;
  if (db_open("/spiffs/base.db", &db_base)) return; 
  static byte o;
  //Serial.print("Bank = "); Serial.println(bank);
  if (bank == 1 ) {o = id;}
  if (bank == 2 ) {o = id + 42;}
  if (bank == 3 ) {o = id + 42*2;}
  if (bank == 4 ) {o = id + 42*3;}
  if (bank == 5 ) {o = id + 42*4;}
  if (bank == 6 ) {o = id + 42*5;}
  for (i = 1; i < 43; i++) {
    slq_request = "SELECT * FROM stomps WHERE stomps_id = " + String(o) + ";";
    db_exec(db_base, slq_request.c_str());
    o = o + 1;
  }
  sqlite3_close(db_base);
}
// ------------------------------------------FIN GESTTION BASE DE DONNEE

// ---------------------------------------------------------------ECRANS
void inti_Encoders(int val1) {
  switch (val1)  {
    case 1 :
      left_encoder.setCount(all_parameters[id][ampero_quick_values[1][ampero_count]]);
      last_value_left_encoder = all_parameters[id][ampero_quick_values[1][ampero_count]];
      right_encoder.setCount(all_parameters[id][tonex_quick_values[1][tonex_count]]);
      last_value_right_encoder = all_parameters[id][tonex_quick_values[1][tonex_count]];
    break;
    case 2 :
      left_encoder.setCount(global_count);
      last_value_left_encoder = global_count;
    break;
    case 3 :
      left_encoder.setCount(all_parameters[id][global_count]);
      last_value_left_encoder = all_parameters[id][global_count];
      right_encoder.setCount(all_parameters[id][global_count]);
      last_value_right_encoder = all_parameters[id][global_count];
    break;
    case 4 :
      right_encoder.setCount(all_parameters[id][global_count]);
      last_value_right_encoder = all_parameters[id][global_count];
    break;
    case 5 :
      right_encoder.setCount(all_parameters[id][global_count]); 
      last_value_right_encoder = all_parameters[id][global_count];
    break;
    case 6 :
      right_encoder.setCount(all_parameters[id][global_count]); 
      last_value_right_encoder = all_parameters[id][global_count];
    break;
    case 7 :
    encoder1_copy_source = 1;
    encoder2_copy_destination = 2;
      left_encoder.setCount(encoder1_copy_source);
      last_value_left_encoder = encoder1_copy_source;
      right_encoder.setCount(encoder2_copy_destination);
      last_value_right_encoder = encoder2_copy_destination;
    break;
  }
}

void encoder_1_moved(int valmini, int valmaxi, int pot, byte sel){
  switch (sel) {
    case 0 :
      pot = left_encoder.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) { pot = valmini; }
      if ( ampero_count < 5 ) {
        midiblabla(ampero_quick_values[0][ampero_count], pot, canal_midi_2);
        all_parameters[id][ampero_quick_values[1][ampero_count]] = pot;
      }
      else {
        if (pot == 1299) {
          midiblabla(ampero_quick_values[0][ampero_count], 0, canal_midi_2); 
          all_parameters[id][ampero_quick_values[1][ampero_count]] = pot;
        }
        if (pot == 1300) {
          midiblabla(ampero_quick_values[0][ampero_count], 127, canal_midi_2);
          all_parameters[id][ampero_quick_values[1][ampero_count]] = pot;
        }
        Serial.println(pot);
      }
      left_encoder.setCount(pot);
      last_value_left_encoder = pot;
      Screens(2, all_parameters[id][ampero_quick_values[1][ampero_count]]);
    break;
    case 1 :
      pot = left_encoder.getCount();
      if (pot > valmaxi) {pot = valmini;}
      if (pot < valmini) {pot = valmaxi;}       
      global_count = pot;
      left_encoder.setCount(pot);
      last_value_left_encoder = pot;
      Screens(1, all_parameters[id][global_count]);
    break;
    case 2 :
      pot = left_encoder.getCount();
      if (pot > valmaxi) {pot = valmini;}
      if (pot < valmini) {pot = valmaxi;}        
      encoder1_copy_source = pot;
      left_encoder.setCount(pot);
      last_value_left_encoder = pot;
      Screens(7, encoder1_copy_source);
    break;
    case 3 :
      pot = left_encoder.getCount();
      if (pot > valmaxi) {pot = valmini;}
      if (pot < valmini) {pot = valmaxi;}        
      encoder1_copy_source = pot;
      left_encoder.setCount(pot);
      last_value_left_encoder = pot;
      Screens(14, encoder1_copy_source);
    break;
  }
  previousMillis = millis(); tmp2 = 1;
}

void encoder_2_moved(int valmini, int valmaxi, int pot, byte sel){
  switch (sel) {
    case 0 :
      pot = right_encoder.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      midiblabla(tonex_quick_values[0][tonex_count], pot, canal_midi_1);
      Screens(3, pot);
      all_parameters[id][tonex_quick_values[1][tonex_count]] = pot;
      right_encoder.setCount(pot);
      last_value_right_encoder = pot;
    break;
    case 1 :
      pot = right_encoder.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      if (global_count == 55) {
        program_change(tonex_bank_choice, pot, canal_midi_1);
        all_parameters[id][global_count] = pot;
      }
      if (global_count == 56) {
        program_change(ampero_bank_choice, pot, canal_midi_2);
        all_parameters[id][global_count] = pot;
        }
      if (global_count != 55 or global_count != 56 or global_count != 54){ // Suppression reglage 54
        all_parameters[id][global_count] = pot;
        if (all_parameters[id][global_count] == 1399 or all_parameters[id][global_count] == 1400){
          if (all_parameters[id][global_count] == 1399){
            midiblabla(global_control_change[global_count], 0, canal_midi_1);
          }
          else {
            midiblabla(global_control_change[global_count], 127, canal_midi_1);
          }
        }
        if (global_count > 17 && global_count < all_parameters[id][54]) {
          if (all_parameters[id][global_count] == 1299){
            midiblabla(global_control_change[global_count], 0, canal_midi_1);
          }
          if (all_parameters[id][global_count] == 1300){
            midiblabla(global_control_change[global_count], 127, canal_midi_1);
          }
          if (all_parameters[id][global_count] < 128){
            midiblabla(global_control_change[global_count], pot, canal_midi_1);
          }
        }
        if (global_count > 0 && global_count < 18) {
          if (all_parameters[id][global_count] == 1299){
            midiblabla(global_control_change[global_count], 0, canal_midi_2);
          }
          if (all_parameters[id][global_count] == 1300){
            midiblabla(global_control_change[global_count], 127, canal_midi_2);
          }
          if (all_parameters[id][global_count] < 128){
            midiblabla(global_control_change[global_count], pot, canal_midi_2);
          }
        }
      }        
      right_encoder.setCount(pot);
      last_value_right_encoder = pot;
    break;
    case 2 :
      pot = right_encoder.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      all_parameters[id][42] = pot;
      right_encoder.setCount(pot);
      last_value_right_encoder = pot;
      typereverb();
    break;
    case 3 :
      pot = right_encoder.getCount();
      if (pot > valmaxi) {pot = valmini;}
      if (pot < valmini) {pot = valmaxi;}        
      encoder2_copy_destination = pot;
      right_encoder.setCount(pot);
      last_value_right_encoder = pot;
      Screens(8, encoder2_copy_destination);
    break;
  }
  previousMillis = millis(); tmp2 = 1;
}

void common_carroussel(){
  Screens(1, all_parameters[id][global_count]);
  static int encvalMax, encvalMini;
  while (menus == 1) {
    inti_Encoders(2);
    if (global_count == 55){inti_Encoders(4);}
    if (global_count == 56){inti_Encoders(5);}
    if (global_count != 55 && global_count !=56){
      inti_Encoders(6);
    }
    if (last_value_left_encoder != left_encoder.getCount()) {
      encoder_1_moved(1,56,global_count,1); 
    } 
    if (last_value_right_encoder != right_encoder.getCount()) {
      if (global_count != 55 && global_count != 56) {
        if (all_parameters[id][global_count] == 1399 or all_parameters[id][global_count] == 1400){
          if (all_parameters[id][global_count] == 1400) {
            tmp = 1400; 
            encvalMax = 1400; 
            encvalMini = 1399;
          }
          else {
            tmp = 1399; 
            encvalMax = 1400; 
            encvalMini = 1399;
          }
        }
        if (all_parameters[id][global_count] == 1299 or all_parameters[id][global_count] == 1300){
          if (all_parameters[id][global_count] == 1300) {
            tmp = 1300; 
            encvalMax = 1300; 
            encvalMini = 1299;
          }
          else {
            tmp = 1299; 
            encvalMax = 1300; 
            encvalMini = 1299;
          }
        }
        if (all_parameters[id][global_count] < 128){
          if (all_parameters[id][global_count] < 128) {
            tmp = -1; 
            encvalMax = global_control_change_max_values[global_count]; 
            encvalMini = 0; 
          }
        }
      } 
      else {
        if (all_parameters[id][55] < 128 && global_count == 55){
          tonex_bank_choice = 0;
        }
        if (all_parameters[id][56] < 128 && global_count == 56){
          ampero_bank_choice =  0;
        }
        if (all_parameters[id][55] > 127 && all_parameters[id][55] < 151 && global_count == 55){
          tonex_bank_choice = 1;
        }
        if (all_parameters[id][56] > 127 && all_parameters[id][56] < 257 && global_count == 56){
          ampero_bank_choice = 1;
        }
        if (all_parameters[id][56] > 255 && all_parameters[id][56] < 301 && global_count == 56){
          ampero_bank_choice = 2;
        }
        tmp = -1; encvalMax = global_control_change_max_values[global_count];
        encvalMini = 0; 
      }
    if (global_count != 42 && global_count != 54){
      encoder_2_moved(encvalMini,encvalMax,global_count,1);
    }
    if (global_count == 42){
      encoder_2_moved(0,global_control_change_max_values[global_count],global_count,2);
    }    
    Screens(1, tmp);
    }
    if (digitalRead(5) == 0) {
      delay(250);
      if (digitalRead(23) == 0) {
        Screens(10, 0);
        idcopy = id;
        saveData(); delay(250);
        ampero_count = 0; tonex_count = 0; 
        if(global_count<18) {
          initial_state = 2;
        } 
        else{
          initial_state = 3;
        } 
        break;
      }
      ampero_count = 0; tonex_count = 0; 
      if(global_count<18) {
        initial_state = 2;
      } 
      else{
        initial_state = 3;
        } 
      break;
    }
    if (digitalRead(23) == 0) {
      delay(250);
      if (digitalRead(5) == 0) {
        Screens(10, 0);
        idcopy = id;
        saveData(); delay(250);
        ampero_count = 0; tonex_count = 0; 
        if(global_count<18) {
          initial_state = 2;
        } 
        else{
          initial_state = 3;
        } 
      break;
      }
      ampero_count = 0; tonex_count = 0; 
      if(global_count<18) {
        initial_state = 2;
      }
      else{
        initial_state = 3;
      }
      break;
    }
  }
  previousMillis = millis(); tmp2 = 1;
}

void pressed_boutton(byte boutton_choiced, byte menu_choiced) {
  switch (boutton_choiced) {
    case 1 :
      switch (menu_choiced) {
        case 0 :
          if (initial_state == 1){
            ampero_count = 0; initial_state = 0;
          }
          if (ampero_count > 0 && ampero_count < 6) {
            ampero_count = ampero_count+1;
          }
          else {
            ampero_count = 1;
            tonex_count = 1;
          }
          inti_Encoders(1);
          if (all_parameters[id][ampero_quick_values[1][ampero_count]] > 1390){
            if (all_parameters[id][ampero_quick_values[1][ampero_count]] == 1399) {
              tmp = 1399;
              }
            else {
              tmp = 1400;
            }
          }
          if (all_parameters[id][ampero_quick_values[1][ampero_count]] > 1290 && all_parameters[id][ampero_quick_values[1][ampero_count]] < 1305) {
            if (all_parameters[id][ampero_quick_values[1][ampero_count]] == 1300) {
              tmp = 1300;
            }
            else {
              tmp = 1299;
            }
          } 
          if (all_parameters[id][ampero_quick_values[1][ampero_count]] < 1000) {
            tmp = -1;
          }
          if (startscreen != 1) {
            Screens(2, tmp);
          }
          else {
            startscreen = 0;
          }
          //displayColor1(rgbcolor[ampero_count]);
          break;
        case 1 : 
          // Screens(1, all_parameters[id][global_count]);
          global_count = 1;
          common_carroussel();
        break;
      }
    break;
    case 2 :
      switch (menu_choiced) {
        case 0 : 
          if (initial_state == 1){
            tonex_count = 0; 
            initial_state = 0;
          }
          if (tonex_count > 0 && tonex_count < 6) {
            tonex_count = tonex_count+1;
          }
          else {tonex_count = 1; ampero_count = 1;}
          inti_Encoders(1);
          if (all_parameters[id][tonex_quick_values[1][tonex_count]] > 1390){
            if (all_parameters[id][tonex_quick_values[1][tonex_count]] == 1399) {
              tmp = 1399;
            }
            else {
              tmp = 1400;
            }
          }
          if (all_parameters[id][tonex_quick_values[1][tonex_count]] > 1290 && all_parameters[id][tonex_quick_values[1][tonex_count]] > 1305) {
              if (all_parameters[id][tonex_quick_values[1][tonex_count]] == 1300) {
                tmp = 1300;
              }
              else {
                tmp = 1299;
              }
            }
          if (all_parameters[id][tonex_quick_values[1][tonex_count]] > 1000) {
            tmp = -1;
          }
          if (startscreen != 1) {
            Screens(3, tmp);
          } else {
            startscreen = 0;
          }
          // displayColor1(rgbcolor[tonex_count]);
        break;
        case 1 :
          global_count = 18;
          common_carroussel();
        break;
      }
    break;
  }
  previousMillis = millis(); tmp2 = 1;
}

void Save_patch_to_selected_patch(){
  Screens(11,0);
  //int j, k, l;
  l = id_values_for_6_foot[encoder1_copy_source];
  k = id_values_for_6_foot[encoder2_copy_destination];
  for (k ; k < id_values_for_6_foot[encoder2_copy_destination]+7; k++ && l++) {
    for (j = 1; j < 60; j++){
      if (j != 55 or j != 56) {
        temp_transfert_datas[j] = all_parameters[l][j];
      }
      if (j == 55) {
        temp_transfert_datas[j] = all_parameters[l][55];
      }
      if (j == 56) {
        temp_transfert_datas[j] = all_parameters[l][56];
      }
    }
    //Serial.println("");Serial.print(" ID = ");Serial.println(l);
    idcopy = k;
    Save_copied_patch();
    delay(50);
  }  
  Screens(5,0);
  delay(800);
  esp_restart();
}

