BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
void init_copy_patch(){
  tmp = 1;
  inti_Encoders(7);
  while (menus == 2){
    if (tmp == 1) {Screens(6, 0); Screens(7,0); Screens(8,0); tmp = 0;}
    if (last_value_left_encoder != left_encoder.getCount()) {
      if(bank == 1){encoder_1_moved(1,6,encoder1_copy_source,2);}
      if(bank == 2){encoder_1_moved(7,12,encoder1_copy_source,2);}
      if(bank == 3){encoder_1_moved(13,18,encoder1_copy_source,2);}
      if(bank == 4){encoder_1_moved(19,24,encoder1_copy_source,2);}
      if(bank == 5){encoder_1_moved(25,30,encoder1_copy_source,2);}
      if(bank == 6){encoder_1_moved(31,36,encoder1_copy_source,2);}
    } 
    if (last_value_right_encoder != right_encoder.getCount()) {
      encoder_2_moved(1,36,encoder2_copy_destination,3);
    } 
    if (digitalRead(5) == 0) {
      delay(250);
      if (digitalRead(23) == 0) {
        Save_patch_to_selected_patch();
      }
      ampero_count = 0; tonex_count = 0;
      initial_state = 2;
      break;
    }
    if (digitalRead(23) == 0) {
      delay(250);
      if (digitalRead(5) == 0) {
        Save_patch_to_selected_patch();
      }
      ampero_count = 0; tonex_count = 0; 
      initial_state = 3;
      break;
    }
  }
  previousMillis = millis(); tmp2 = 1;
}

void pre_Save_scenes(){
  Screens(13, 0);               //  1 2  3  4  5  6   7  8  9 10 11 12  13 14 15  16  17  18   19  20  21  22  23  24   25  26  27  28  29  30   31  32  33  34  35  36 
  //static int id_values_for_6_foot [37] = {0,1,8,15,22,29,36, 43,50,57,64,71,78, 85,92,99,106,113,120, 127,134,141,148,155,162, 169,176,183,190,197,204, 211,218,225,232,239,246};
  if (bank == 1){m = id_values_for_6_foot[encoder1_copy_source];}
  if (bank == 2){m = id_values_for_6_foot[encoder1_copy_source+6];}
  if (bank == 3){m = id_values_for_6_foot[encoder1_copy_source+12];}
  if (bank == 4){m = id_values_for_6_foot[encoder1_copy_source+18];}
  if (bank == 5){m = id_values_for_6_foot[encoder1_copy_source+24];}
  if (bank == 6){m = id_values_for_6_foot[encoder1_copy_source+30];}
  for (j = id_values_for_6_foot[encoder1_copy_source]; j < id_values_for_6_foot[encoder1_copy_source]+7; j++ && m++){
    idcopy = m; 
    Save_scenes();
  }
  ampero_count = 0; tonex_count = 0;
}

void Init_save_scenes(){
  tmp = 1; l = 0;
  while (menus == 2){
    server.handleClient();
    if (tmp == 1) {Screens(12, 0);tmp = 0;}
    if (last_value_left_encoder != left_encoder.getCount()) {
      encoder_1_moved(1,6,encoder1_copy_source,2);
    } 
    if (digitalRead(5) == 0) {
      delay(250);
      if (digitalRead(5) == 0) {
          l = 1;
          pre_Save_scenes();
        }
      initial_state = 2;
      break;
    }
    if (digitalRead(23) == 0) {
      delay(250);
      if (digitalRead(23) == 0) {
          l = 2;
          pre_Save_scenes();
        }
      initial_state = 3;
      break;
    }
  }
}

void program_change_value(){
  if (all_parameters[id][55] < 128 or all_parameters[id][56] < 128){ampero_bank_choice = 0; tonex_bank_choice = 0;}
  if (all_parameters[id][55] > 127 && all_parameters[id][55] < 151){tonex_bank_choice = 1;}
  if (all_parameters[id][56] > 127 && all_parameters[id][56] < 257){ampero_bank_choice = 1;}
  if (all_parameters[id][56] > 255 && all_parameters[id][56] < 301){ampero_bank_choice = 2;}
}

void first_load(){
  program_change(tonex_bank_choice, all_parameters[id][55], canal_midi_1);
  delay(100);
  program_change(ampero_bank_choice,  all_parameters[id][56], canal_midi_2);
  delay(100);
  for (i = 18; i < all_parameters[id][54]; i++){
    if (all_parameters[id][i] == 1399) {MIDI.sendControlChange(global_control_change[i], 0, canal_midi_1);}
    if (all_parameters[id][i] == 1400) {MIDI.sendControlChange(global_control_change[i], 127, canal_midi_1);}
    if (all_parameters[id][i] == 1299) {MIDI.sendControlChange(global_control_change[i], 0, canal_midi_1);}
    if (all_parameters[id][i] == 1300) {MIDI.sendControlChange(global_control_change[i], 127, canal_midi_1);}
    if (i == 42) {typereverb();}
    else {if (all_parameters[id][i] < 128) {MIDI.sendControlChange(global_control_change[i], all_parameters[id][i], canal_midi_1);}}
    delay(15);
  }
  for (i = 1; i < 18; i++){
    if (i < 14) {
      if (all_parameters[id][i] == 1299) {MIDI.sendControlChange(global_control_change[i], 0, canal_midi_2);}
      else {MIDI.sendControlChange(global_control_change[i], 127, canal_midi_2);}
    if (i > 13) {MIDI.sendControlChange(global_control_change[i], all_parameters[id][i], canal_midi_2);}
    delay(5);
    }
  }
}

void load_Ampero() {
  if (all_parameters[id][i] == 1299) {MIDI.sendControlChange(global_control_change[i], 0, canal_midi_2);}
  if (all_parameters[id][i] == 1300) {MIDI.sendControlChange(global_control_change[i], 127, canal_midi_2);}
  if (i > 13) {MIDI.sendControlChange(global_control_change[i], all_parameters[id][i], canal_midi_2);}
  //Serial.print(i);Serial.print("="); Serial.print(all_parameters[id][i]);Serial.print("|");
}

void load_toneX() {
  if (all_parameters[id][i] == 1399) {MIDI.sendControlChange(global_control_change[i], 0, canal_midi_1);}
  if (all_parameters[id][i] == 1400) {MIDI.sendControlChange(global_control_change[i], 127, canal_midi_1);}
  if (all_parameters[id][i] == 1299) {MIDI.sendControlChange(global_control_change[i], 0, canal_midi_1);}
  if (all_parameters[id][i] == 1300) {MIDI.sendControlChange(global_control_change[i], 127, canal_midi_1);}
  if (all_parameters[id][i] < 128) {if (i != 42) {MIDI.sendControlChange(global_control_change[i], all_parameters[id][i], canal_midi_1);}}
  if (i == 42) {global_count = 42; typereverb();}
  delay(15);
  //Serial.print(i);Serial.print("="); Serial.print(all_parameters[id][i]);Serial.print("|");
}

void load_preset() {
  byte tmp5 = 0;
  if (all_parameters[id][56] != all_parameters[preid][56]) {program_change(ampero_bank_choice,  all_parameters[id][56], canal_midi_2); }
  if (all_parameters[id][55] != all_parameters[preid][55]) {program_change(tonex_bank_choice, all_parameters[id][55], canal_midi_1); }
  
