BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
  for (i = 1; i < 18; i++){
    if (all_parameters[id][56] != all_parameters[preid][56]) {
      load_Ampero();
      tmp5 = 1;
    }
    if (all_parameters[id][i] != all_data_base_parameters_copy[preid][i] && tmp5 == 0) {
      load_Ampero(); 
      tmp5 = 0;
    }
  }
  tmp5 = 0;
  //Serial.print(" // "); 
  if (all_parameters[id][55] != all_parameters[preid][55]) {program_change(tonex_bank_choice, all_parameters[id][55], canal_midi_1); }
  delay(30);
  for (i = 18; i < 46; i++){
    if (all_parameters[id][55] != all_parameters[preid][55]) {load_toneX(); tmp5 = 1;}
    if (all_parameters[id][i] != all_data_base_parameters_copy[preid][i] && tmp5 == 0) {load_toneX(); tmp5 = 0;}
  }
  //Serial.println("");
}

void Select() {
  program_change_value();
  if (initial_state == 1) {readData(); program_change_value(); first_load(); old_bank = bank;}
  if (bank != old_bank) {
    Screens(9, 0); 
    readData(); 
    old_bank = bank; line1_lcd_text = "toto"; line2_lcd_text = "toto"; 
    Screens(2, 0);}
}

void handleControlChange(byte channel, byte number, byte value) {
  if (channel == 12){bank = value; Select(); program_change_value(); first_load();}
  //Serial.print("Bank = ");Serial.println(bank);
  if (channel == 16) {
    choiced_foot_on_pacer = 1;
    preid = id; 
    id_init = value; id = value;
    ampero_count = 0; tonex_count = 0; menus = 0;
    Select(); 
    load_preset();
    pressed_boutton(1, menus);
    if (id < 8) {choiced_foot_on_pacer = 1;}
    if (id > 7 && id < 14) {choiced_foot_on_pacer = 2;}
    if (id > 13 && id < 21) {choiced_foot_on_pacer = 3;}
    if (id > 20 && id < 28) {choiced_foot_on_pacer = 4;}
    if (id > 27 && id < 35) {choiced_foot_on_pacer = 5;}
    if (id > 34 && id < 43) {choiced_foot_on_pacer = 6;}
    stomp = 0;
    Screens(4, 0);
    tmp2 = 0; line1_lcd_text = "toto"; line2_lcd_text = "toto";
  }

  if (channel == 15) {
    preid = id;
    stomp = value;
    id = id_init + value;
    ampero_count = 0; tonex_count = 0; menus = 0;
    load_preset();
    pressed_boutton(1, menus);
    Screens(4, 0);
    tmp2 = 0; line1_lcd_text = "toto"; line2_lcd_text = "toto";
  }
}

//---PARTIE WEB SERVER http://fileserver.local ou http://192.168.8.117
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SendHTML_Header() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", ""); // Empty content inhibits Content-length header so we have to close the socket ourselves.
  append_page_header();
  server.sendContent(webpage);
  webpage = "";
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SendHTML_Stop() {
  server.sendContent("");
  server.client().stop(); // Stop is needed because no content length was sent
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SendHTML_Content() {
  server.sendContent(webpage);
  webpage = "";
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void ReportFileNotPresent(String target) {
  SendHTML_Header();
  webpage += F("<h3>File does not exist</h3>");
  webpage += F("<a href='/"); webpage += target + "'>[Back]</a><br><br>";
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SD_file_download(String filename) {
  File download = SPIFFS.open("/" + filename, "r");
  if (download) {
    server.sendHeader("Content-Type", "text/text");
    server.sendHeader("Content-Disposition", "attachment; filename=" + filename);
    server.sendHeader("Connection", "close");
    server.streamFile(download, "application/octet-stream");
    download.close();
  } else ReportFileNotPresent("download");
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SelectInput(String heading1, String heading2, String command, String arg_calling_name) {
  SendHTML_Header();
  webpage += F("<h3 class='rcorners_m'>"); webpage += heading1 + "</h3><br>";
  webpage += F("<h3>"); webpage += heading2 + "</h3>";
  webpage += F("<FORM action='/"); webpage += command + "' method='post'>"; // Must match the calling argument e.g. '/chart' calls '/chart' after selection but with arguments!
  webpage += F("<input type='text' name='"); webpage += arg_calling_name; webpage += F("' value=''><br>");
  webpage += F("<type='submit' name='"); webpage += arg_calling_name; webpage += F("' value=''><br><br>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void File_Download() { // This gets called twice, the first pass selects the input, the second pass then processes the command line arguments
  if (server.args() > 0 ) { // Arguments were received
    if (server.hasArg("download")) SD_file_download(server.arg(0));
  }
  else SelectInput("File Download", "Enter filename to download", "download", "download");
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void HomePage() {
  SendHTML_Header();
  webpage += F("<a href='/download'><button>Download</button></a>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop(); // Stop is needed because no content length was sent
}


void setup() {
  pinMode(33, OUTPUT); pinMode(32, OUTPUT); pinMode(25, OUTPUT);

  preid = -1; 
  
  LCD.init();
  LCD.backlight();
  
  Screens(0, 0);
  
  Serial.begin(115200);
  //Serial2.begin(9600);
  MIDI.begin(MIDI_CHANNEL_OMNI);  
  MIDI.setHandleControlChange(handleControlChange);

  Wire.begin(22, 21);

  button7.setPressTicks(500);
  button8.setPressTicks(500);

  button7.attachClick([] () {if(menus == 0) {boutton_choice = 1; pressed_boutton(1, menus);}});
  button8.attachClick([] () {if(menus == 0) {boutton_choice = 2; pressed_boutton(2, menus);}});

  button7.attachLongPressStop([] () {line2_lcd_text = "toto"; menus = 1; boutton_choice = 1; pressed_boutton(1, menus);});
  button8.attachLongPressStop([] () {line2_lcd_text = "toto"; menus = 1; boutton_choice = 2; pressed_boutton(2, menus);});

  button7.attachDoubleClick([] () {line2_lcd_text, line1_lcd_text = "toto"; menus = 2; Init_save_scenes();});
  button8.attachDoubleClick([] () {line2_lcd_text, line1_lcd_text = "toto"; menus = 2; init_copy_patch();});

  if(SPIFFS.begin(true)){
    File root = SPIFFS.open("/"); bank = 1; id = 1, id_init = id; initial_state = 1; choiced_foot_on_pacer = 1; Select(); preid = 0;}
  else {Serial.println("SPIFFS marche pas");} 

  ESP32Encoder::useInternalWeakPullResistors=NONE;
  left_encoder.attachSingleEdge(15, 4);
  right_encoder.attachSingleEdge(18, 19);
  left_encoder.clearCount();
  left_encoder.setFilter(1023);
  right_encoder.clearCount();
  right_encoder.setFilter(1023);
    
