BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
  //previousMillis = millis();

  inti_Encoders(1);

  line2_lcd_text, line1_lcd_text = "toto";
  pressed_boutton(1, menus);
  pressed_boutton(2, menus);
  previousMillis = millis();
  tmp2 = 1;

  WiFi.mode(WIFI_AP_STA);
  WiFi.begin(ssid2, password2);
  while (WiFi.status() != WL_CONNECTED) { // Wait for the Wi-Fi to connect
    delay(500);
    Serial.print(".");
  }
  Serial.println(".");
  Serial.println("Wifi connecté");
  ip = WiFi.localIP();
  server.on("/",              HomePage);
  server.on("/download", File_Download);
  server.begin();

  LCD.clear();
  LCD.setCursor(7,0);
  LCD.print("IP");
  LCD.setCursor(2,1);
  LCD.print(ip);
  delay(5000);
}
//----------------------------------------------------------------------------------END SETUP

void loop(){
  button7.tick();
  button8.tick();
  if (last_value_left_encoder != left_encoder.getCount()) {
    if (ampero_count == 0) {
      ampero_count = 1;
    }
    encoder_1_moved(values_mini_ampero_quick[ampero_count],values_max_ampero_quick[ampero_count],all_parameters[id][ampero_quick_values[1][ampero_count]],0);
    line2_lcd_text, line1_lcd_text = "toto";
  }  
  if (last_value_right_encoder != right_encoder.getCount()) {
    if (tonex_count == 0) {
      tonex_count = 1;
    }
    if (tonex_count != 0) {
      encoder_2_moved(values_mini_tonex_quick[tonex_count],values_max_tonex_quick[tonex_count],all_parameters[id][tonex_quick_values[1][tonex_count]],0);
    }
    line2_lcd_text, line1_lcd_text = "toto";
  }
  MIDI.read();
  if (initial_state == 2) {
    initial_state = 0;
    menus = 0; 
    line1_lcd_text = "toto"; 
    line2_lcd_text = "toto"; 
    pressed_boutton(1, menus); 
    Screens(2, 0);
  }  
  if (initial_state == 3) {
    initial_state = 0; 
    menus = 0; 
    line1_lcd_text = "toto"; 
    line2_lcd_text = "toto"; 
    pressed_boutton(2, 
    menus); 
    Screens(3, 0);
  }
  if (millis() - previousMillis >= interval && tmp2 == 1) {
    Screens(4, 0); 
    tmp2 = 0; 
    line1_lcd_text = "toto"; 
    line2_lcd_text = "toto";
  }
}

